In [1]:
%load_ext sql
%sql mysql://root:root@localhost/testing_system_db

In [2]:
%%sql
USE testing_system_db;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [3]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[('account',),
 ('answer',),
 ('categoryquestion',),
 ('department',),
 ('exam',),
 ('examquestion',),
 ('group',),
 ('groupaccount',),
 ('position',),
 ('question',),
 ('typequestion',)]

# Question 1. Thêm ít nhất 10 record vào mỗi bảng

In [ ]:
%%sql
USE Testing_System_Db;      
INSERT INTO `Position`	    (PositionName	               ) 
VALUES 	                    ('HR Specialist'               ),
                            ('Marketer'                    ),
                            ('Financial Analyst'           ),
                            ('Operator'                    );

USE Testing_System_Db;
INSERT INTO `Account`       (Email					        , Username			    , FullName		    , DepartmentID	, PositionID, CreateDate    )
VALUES                      ('jessica4@gmail.com'           , 'jessica_garcia'      , 'Jessica Garcia'  , 3             , 8         , '2024-03-10'  ), -- HR Specialist
                            ('amanda123@outlook.com'        , 'amanda_thompson'     , 'Amanda Thompson' , 2             , 9         , '2024-03-10'  ), -- Marketer
                            ('daniel12@yahoo.com'           , 'daniel_rodriguez'    , 'Daniel Rodriguez', 3             , 8         , '2024-03-20'  ), -- HR Specialist
                            ('ashley.martinez@aol.com'      , 'ashley_martinez'     , 'Ashley Martinez' , 4             , 10        , '2024-03-21'  ), -- Financial Analyst
                            ('james99@aol.com'              , 'james_lopez'         , 'James Lopez'     , 4             , 11        , '2024-03-21'  ), -- Operator
                            ('alice.smith456@hotmail.com'   , 'alice_smith'         , 'Alice Smith'     , 1             , 6         , '2024-05-15'  ), -- Engineer
                            ('bob.jones789@protonmail.com'  , 'bob_jones'           , 'Bob Jones'       , 1             , 6         , '2024-05-16'  ), -- Engineer
                            ('carol.wilson123@live.com'     , 'carol_wilson'        , 'Carol Wilson'    , 2             , 11        , '2024-05-31'  ), -- Operator
                            ('dave_clark456@yandex.com'     , 'dave_clark'          , 'Dave Clark'      , 2             , 11        , '2024-05-31'  ), -- Operator
                            ('ryan.martinez@icloud.com'     , 'ryan_martinez'       , 'Ryan Martinez'   , 2             , 11        , '2024-05-31'  ); -- Operator

USE Testing_System_Db;
INSERT INTO `Group`	        (GroupName			            , CreatorID		        , CreateDate        )
VALUES                      ('Marketing Team'               , 4                     , '2024-03-11'      ), -- Created by Jane Smith
                            ('HR Team'                      , 1                     , '2024-03-11'      ), -- Created by Michael Johnson                            
                            ('Finance Team'                 , 5                     , '2024-03-23'      ), -- Created by Emily Davis
                            ('ENG_Help Team'                , 2                     , '2024-03-27'      ), -- Created by John Doe
                            ('Analyst Team'                 , 4                     , '2024-03-30'      ); -- Created by Jane Smith

USE Testing_System_Db;
INSERT INTO `GroupAccount`  (GroupID	                    , AccountID	            , JoinDate	        )
VALUES                      (2                              , 10                    , '2024-03-11'      ), -- Jessica Garcia joined HR Support
                            (2                              , 11                    , '2024-03-11'      ), -- Amanda Thompson joined HR Support
                            (2                              , 12                    , '2024-03-21'      ), -- Daniel Rodriguez joined HR Support
                            (2                              , 13                    , '2024-03-22'      ), -- Ashley Martinez joined HR Support
                            (2                              , 14                    , '2024-03-22'      ), -- James Lopez joined HR Support
                            (2                              , 15                    , '2024-05-16'      ), -- Alice Smith joined HR Support
                            (2                              , 16                    , '2024-05-17'      ), -- Bob Jones joined HR Support
                            (2                              , 17                    , '2024-06-01'      ), -- Carol Wilson joined HR Support
                            (2                              , 18                    , '2024-06-01'      ), -- Dave Clark joined HR Support
                            (2                              , 19                    , '2024-06-01'      ), -- Ryan Martinez joined HR Support         
                            (3                              , 15                    , '2024-05-16'      ), -- Alice Smith joined ENG Team
                            (3                              , 16                    , '2024-05-17'      ), -- Bob Jones joined ENG Team
                            (4                              , 14                    , '2024-03-23'      ), -- James Lopez joined Operation Team  
                            (4                              , 17                    , '2024-06-01'      ), -- Carol Wilson joined Operation Team 
                            (4                              , 18                    , '2024-06-01'      ), -- Dave Clark joined Operation Team   
                            (4                              , 19                    , '2024-06-01'      ), -- Ryan Martinez joined Operation Team       
                            (6                              , 1                     , '2024-03-11'      ), -- Michael Johnson joined HR Team            
                            (6                              , 10                    , '2024-03-11'      ), -- Jessica Garcia joined HR Team  
                            (6                              , 12                    , '2024-03-21'      ), -- Daniel Rodriguez joined HR Team         
                            (7                              , 5                     , '2024-03-23'      ), -- Emily Davis joined Finance Team           
                            (7                              , 13                    , '2024-03-24'      ), -- Ashley Martinez joined Finance Team      
                            (8                              , 2                     , '2024-03-27'      ), -- John Doe joined ENG HELP Team                  
                            (8                              , 3                     , '2024-03-27'      ), -- David Brown joined ENG HELP Team         
                            (8                              , 6                     , '2024-03-27'      ), -- Sarah Wilson joined ENG HELP Team         
                            (8                              , 7                     , '2024-03-27'      ), -- Christopher Lee joined ENG HELP Team      
                            (8                              , 15                    , '2024-05-17'      ), -- Alice Smith joined ENG HELP Team          
                            (8                              , 16                    , '2024-05-18'      ), -- Bob Jones joined ENG HELP Team            
                            (5                              , 4                     , '2024-03-30'      ), -- Jane Smith joined Marketing Team          
                            (5                              , 11                    , '2024-03-30'      ); -- Amanda Thompson joined Marketing Team

USE Testing_System_Db;
INSERT INTO Question        (`Content`			                                                , CategoryID    , TypeID	 , CreatorID    , CreateDate )
VALUES                      (N'Có bao nhiêu bước trong phương pháp 5S nơi làm việc'             , 3             , 2         , 3            , '2024-04-01'),
                            (N'Kể tên những mối nguy về hóa chất có thể gặp'                    , 3             , 1         , 3            , '2024-04-01'),
                            (N'Quy định về việc trang bị đẩy đủ bảo hộ lao động'                , 2             , 1         , 3            , '2024-04-01'),
                            (N'Bạn biết gì về nguyên lý 80/20'                                  , 6             , 1         , 5            , '2024-04-20'),
                            (N'5W1H và 5M1E là viết tắt của những từ gì?'                       , 6             , 2         , 5            , '2024-04-20'),
                            (N'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ'     , 6             , 1         , 5            , '2024-04-20'),
                            (N'Mục tiêu chất lượng của công ty là gì?'                          , 4             , 1         , 4            , '2024-04-22'),
                            (N'Mục tiêu không tai nạn lao động trong 1 năm'                     , 4             , 2         , 1            , '2024-04-25'),
                            (N'Công ty đang sản xuất những mặt hàng nào'                        , 5             , 1         , 3            , '2024-04-26'),
                            (N'Các lỗi sản phẩm hay gặp trong sản xuất'                         , 5             , 2         , 3            , '2024-04-26');

USE Testing_System_Db;
INSERT INTO Answer          (`Content`      , QuestionID, isCorrect )
VALUES                      (N'Trả lời 20'  , 9         , 0         ),
                            (N'Trả lời 21'  , 10        , 1         ),
                            (N'Trả lời 22'  , 17        , 1         ),
                            (N'Trả lời 23'  , 18        , 1         ),
                            (N'Trả lời 24'  , 11        , 0         ),
                            (N'Trả lời 25'  , 10        , 1         ),
                            (N'Trả lời 26'  , 16        , 1         ),
                            (N'Trả lời 27'  , 11        , 0         ),
                            (N'Trả lời 28'  , 12        , 1         ),
                            (N'Trả lời 29'  , 12        , 0         ),
                            (N'Trả lời 30'  , 1         , 1         ),
                            (N'Trả lời 31'  , 1         , 1         ),
                            (N'Trả lời 32'  , 15        , 0         ),
                            (N'Trả lời 33'  , 3         , 0         ),
                            (N'Trả lời 34'  , 9         , 1         ),
                            (N'Trả lời 35'  , 5         , 0         ),
                            (N'Trả lời 36'  , 13        , 1         ),
                            (N'Trả lời 37'  , 12        , 1         ),
                            (N'Trả lời 38'  , 13        , 1         ),
                            (N'Trả lời 39'  , 14        , 0         ),
                            (N'Trả lời 40'  , 15        , 1         ),
                            (N'Trả lời 41'  , 14        , 0         );

USE Testing_System_Db;
INSERT INTO Exam            (`Code`         , Title                 , CategoryID, Duration  , CreatorID , CreateDate )
VALUES                      ('VTIQ009'      , N'Đề thi 5S'          , 2         , 60        , 2         ,'2024-04-05'),
                            ('VTIQ010'      , N'Đề thi An toàn'     , 1         , 60        , 1         ,'2024-04-06'),
                            ('VTIQ011'      , N'Đề thi Phân tích'   , 1         , 120       , 1         ,'2024-04-20'),
                            ('VTIQ012'      , N'Đề thi An toàn'     , 2         , 120       , 2         ,'2024-04-21'),
                            ('VTIQ013'      , N'Đề thi Mục tiêu'    , 2         , 60        , 2         ,'2024-04-25'),
                            ('VTIQ014'      , N'Đề thi Sản phẩm'    , 1         , 120       , 1         ,'2024-04-26'),
                            ('VTIQ015'      , N'Đề thi Phân tích'   , 2         , 60        , 2         ,'2024-04-27'),
                            ('VTIQ016'      , N'Đề thi Sản phẩm'    , 2         , 60        , 2         ,'2024-04-27'),
                            ('VTIQ017'      , N'Đề thi Phân tích'   , 2         , 60        , 2         ,'2024-04-28'),
                            ('VTIQ018'      , N'Đề thi Mục tiêu'    , 2         , 60        , 2         ,'2024-04-30');

USE Testing_System_Db;
INSERT INTO ExamQuestion    (ExamID , QuestionID)
VALUES                      (9      , 9         ),
                            (10     , 11        ),
                            (11     , 13        ),
                            (12     , 10        ),
                            (13     , 16        ),
                            (14     , 17        ),
                            (15     , 12        ),
                            (16     , 18        ),
                            (17     , 14        ),
                            (18     , 15        );

# Question 2. Truy vấn tất cả các phòng ban

In [4]:
%%sql
SELECT *
FROM department
ORDER BY `DepartmentID`;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 'Engineering'),
 (2, 'Marketing'),
 (3, 'Human Resources'),
 (4, 'Finance'),
 (5, 'Operations')]

# Question 3. Truy vấn ID của phòng Marketing

In [5]:
%%sql
SELECT *
FROM department
WHERE `DepartmentName`='Marketing'

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(2, 'Marketing')]

# Question 4. Truy vấn Account có full name dài nhất

In [6]:
%%sql
SELECT *, LENGTH(`FullName`) AS Fullname_Length
FROM `account`
ORDER BY Fullname_Length DESC
LIMIT 5;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(9, 'nathan_hernandez123@yahoo.com', 'nathan_hernandez', 'Nathan Hernandez', 5, 7, datetime.datetime(2024, 3, 2, 0, 0), 16),
 (12, 'daniel12@yahoo.com', 'daniel_rodriguez', 'Daniel Rodriguez', 3, 8, datetime.datetime(2024, 3, 20, 0, 0), 16),
 (1, 'michael.123@outlook.com', 'michael_johnson', 'Michael Johnson', 3, 3, datetime.datetime(2024, 2, 1, 0, 0), 15),
 (7, 'christopher_lee123@yahoo.com', 'christopher_lee', 'Christopher Lee', 1, 6, datetime.datetime(2024, 3, 1, 0, 0), 15),
 (11, 'amanda123@outlook.com', 'amanda_thompson', 'Amanda Thompson', 2, 9, datetime.datetime(2024, 3, 10, 0, 0), 15)]

In [7]:
%%sql
SELECT MAX(LENGTH(`FullName`))
FROM `account`

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(16,)]

In [8]:
%%sql
SELECT *, LENGTH(`FullName`)
FROM `account`
WHERE LENGTH(`FullName`) = (
                            SELECT MAX(LENGTH(`FullName`))
                            FROM `account`
                            );

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(9, 'nathan_hernandez123@yahoo.com', 'nathan_hernandez', 'Nathan Hernandez', 5, 7, datetime.datetime(2024, 3, 2, 0, 0), 16),
 (12, 'daniel12@yahoo.com', 'daniel_rodriguez', 'Daniel Rodriguez', 3, 8, datetime.datetime(2024, 3, 20, 0, 0), 16)]

# Question 5. Truy vấn Account có full name dài nhất và thuộc phòng ban có ID = 3

In [9]:
%%sql
SELECT  *, LENGTH(`FullName`)
FROM    `account`
WHERE   LENGTH(`FullName`) = (SELECT MAX(LENGTH(`FullName`)) FROM `account`)
AND     `DepartmentID` = 3;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(12, 'daniel12@yahoo.com', 'daniel_rodriguez', 'Daniel Rodriguez', 3, 8, datetime.datetime(2024, 3, 20, 0, 0), 16)]

# Question 6. Truy vấn tên Group đã tham gia trước ngày 11/03/2024

In [10]:
%%sql
SELECT  `GroupName`, `CreateDate`
FROM    `group`
WHERE   `CreateDate`< '2024-03-11';

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[('Management Team', datetime.datetime(2024, 2, 23, 0, 0)),
 ('HR Support', datetime.datetime(2024, 3, 1, 0, 0)),
 ('ENG Team', datetime.datetime(2024, 3, 2, 0, 0)),
 ('Operations Team', datetime.datetime(2024, 3, 3, 0, 0))]

# Question 7. Truy vấn ID của Question có >= 4 câu trả lời

In [11]:
%%sql
SELECT      `QuestionID`, COUNT(`AnswerID`) AS NUM_ASQW
FROM        answer
GROUP BY    `QuestionID`
ORDER BY    NUM_ASQW DESC
LIMIT       5;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 5), (3, 4), (5, 4), (12, 3), (8, 3)]

In [12]:
%%sql
SELECT      `QuestionID`, COUNT(`AnswerID`) AS NUM_ASQW
FROM        answer
GROUP BY    `QuestionID`
HAVING      COUNT(`AnswerID`) >= 4;

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(1, 5), (3, 4), (5, 4)]

# Question 8. Truy vấn các mã đề thi có thời gian thi > 60 phút và được tạo trước ngày 05/04/2024

In [13]:
%%sql
SELECT  *
FROM    exam
WHERE   `Duration` > 60 AND `CreateDate` < '2024-04-05';

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(3, 'VTIQ003', 'Đề thi Nội quy', 1, 120, 1, datetime.datetime(2024, 3, 16, 0, 0)),
 (4, 'VTIQ004', 'Đề thi An toàn', 2, 120, 2, datetime.datetime(2024, 3, 17, 0, 0)),
 (6, 'VTIQ006', 'Đề thi Nội quy', 1, 120, 1, datetime.datetime(2024, 3, 20, 0, 0))]

# Question 9. Truy vấn 5 group được tạo gần đây nhất

In [14]:
%%sql
SELECT      *
FROM        `group`
ORDER BY    `CreateDate` DESC
LIMIT       5;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(9, 'Analyst Team', 4, datetime.datetime(2024, 3, 30, 0, 0)),
 (8, 'ENG_Help Team', 2, datetime.datetime(2024, 3, 27, 0, 0)),
 (7, 'Finance Team', 5, datetime.datetime(2024, 3, 23, 0, 0)),
 (5, 'Marketing Team', 4, datetime.datetime(2024, 3, 11, 0, 0)),
 (6, 'HR Team', 1, datetime.datetime(2024, 3, 11, 0, 0))]

# Question 10. Truy vấn số nhân viên thuộc Department có ID = 2

In [15]:
%%sql
SELECT      `DepartmentID`, COUNT(`AccountID`)
FROM        `account`
GROUP BY    `DepartmentID`
HAVING      `DepartmentID` = 2;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(2, 5)]

# Question 11. Truy vấn Nhân viên có tên bắt đầu bằng "R" và kết thúc bằng "z"

In [16]:
%%sql
SELECT  *
FROM    `account`
WHERE   `FullName` LIKE 'R%z';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(19, 'ryan.martinez@icloud.com', 'ryan_martinez', 'Ryan Martinez', 2, 11, datetime.datetime(2024, 5, 31, 0, 0))]

In [17]:
%%sql
SELECT	*
From	`account`
WHERE	SUBSTRING_INDEX(FullName,' ',-1) LIKE 'R%z';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(12, 'daniel12@yahoo.com', 'daniel_rodriguez', 'Daniel Rodriguez', 3, 8, datetime.datetime(2024, 3, 20, 0, 0))]

# Question 12. Xóa tất cả các Exam được tạo trước ngày 10/03/2023

1. Tạo 1 dòng ghi mới để thực hành lệnh xóa

In [28]:
%%sql
INSERT INTO Exam            (`Code`         , Title                 , CategoryID, Duration  , CreatorID , CreateDate )
VALUES                      ('VTIQ000'      , N'Đề thi thử'         , 1         , 60        , 1         ,'2024-03-01');

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

Kiểm tra dòng ghi này đã được tạo ra chưa

In [29]:
%%sql
SELECT      *
FROM        exam
WHERE       `CreateDate` <= '2024-03-01';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(22, 'VTIQ000', 'Đề thi thử', 1, 60, 1, datetime.datetime(2024, 3, 1, 0, 0))]

Trong bảng ExamQuestion có ràng buộc khóa ngoại với cột ExamID, tham chiếu đến cột ExamID trong bảng Exam. Điều này đảm bảo rằng ExamID trong bảng ExamQuestion phải là một giá trị hợp lệ trong bảng Exam.

Để biết tên chính xác của ràng buộc khóa ngoại hiện tại, ta có thể sử dụng câu lệnh:

In [27]:
%%sql
SHOW CREATE TABLE ExamQuestion;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[('ExamQuestion', 'CREATE TABLE `examquestion` (\n  `ExamID` tinyint unsigned NOT NULL,\n  `QuestionID` tinyint unsigned NOT NULL,\n  PRIMARY KEY (`ExamID`,`QuestionID` ... (184 characters truncated) ... KEY (`ExamID`) REFERENCES `exam` (`ExamID`) ON DELETE RESTRICT ON UPDATE RESTRICT\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci')]

Vì vậy ta tạo thêm một dòng ghi trong bảng ExamQuestion để khảo sát việc xóa PK ảnh hưởng đến FK như thế nào:

In [30]:
%%sql
INSERT INTO ExamQuestion    (ExamID , QuestionID)
VALUES                      (22     , 1         );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

2. Thử xóa dòng ghi mới này

In [31]:
%%sql
DELETE FROM     Exam
WHERE			`CreateDate` <= '2024-03-01';

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.IntegrityError) (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`testing_system_db`.`examquestion`, CONSTRAINT `examquestion_ibfk_2` FOREIGN KEY (`ExamID`) REFERENCES `exam` (`ExamID`) ON DELETE RESTRICT ON UPDATE RESTRICT)')
[SQL: DELETE FROM     Exam
WHERE			`CreateDate` <= '2024-03-01';]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

Ta sẽ nhận được báo lỗi:
```SQL
Cannot delete or update a parent row: a foreign key constraint fails (`testing_system_db`.`examquestion`, CONSTRAINT `examquestion_ibfk_2` FOREIGN KEY (`ExamID`) REFERENCES `exam` (`ExamID`))
```
có nghĩa là bạn không thể thực hiện thao tác xóa hoặc cập nhật một hàng "cha" trong bảng mà có các hàng "con" trong bảng khác tham chiếu đến nó thông qua ràng buộc khóa ngoại (đây là hành vi mặc định được gọi là RESTRICT hoặc NO ACTION)

Trước tiên ta phải gỡ bỏ ràng buộc Fk hiện tại có tên `examquestion_ibfk_2`:

In [32]:
%%sql
ALTER TABLE ExamQuestion
DROP FOREIGN KEY examquestion_ibfk_2;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

Sau đó ta sẽ phải sửa lại ràng buộc FK này với ON DELETE CASCADE (tự động xóa các hàng liên quan khi hàng cha được xóa):

In [33]:
%%sql
ALTER TABLE ExamQuestion
ADD CONSTRAINT examquestion_ibfk_2
FOREIGN KEY (ExamID) REFERENCES Exam(ExamID)
ON DELETE CASCADE
ON UPDATE CASCADE;

 * mysql://root:***@localhost/testing_system_db
19 rows affected.

[]

Đến đây, ta thử lại việc xóa dòng ghi:

In [34]:
%%sql
DELETE FROM     Exam
WHERE			`CreateDate` <= '2024-03-01';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

Kiểm tra lại dòng ghi đã được xóa hay chưa

In [35]:
%%sql
SELECT      *
FROM        exam
WHERE       `CreateDate` <= '2024-03-01';

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

Ta cũng kiểm tra dữ liệu hàng con trong bảng ExamQuestion đã bị xóa hay chưa

In [36]:
%%sql
SELECT      *
FROM        examquestion
ORDER BY    `ExamID` DESC
LIMIT 5;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(18, 15), (17, 14), (16, 18), (15, 12), (14, 17)]

# Question 13. Xóa tất cả các Question có nội dung bắt đầu bằng từ "câu hỏi"

In [42]:
%%sql
INSERT INTO Question    (`Content`      , CategoryID    , TypeID	, CreatorID    , CreateDate )
VALUES 		            (N'Câu hỏi thử' , 1             , 1         , 1            , '2024-03-01');

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [43]:
%%sql
SELECT *
FROM Question
WHERE SUBSTRING_INDEX(`Content`, ' ', 2) = 'Câu hỏi';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(19, 'Câu hỏi thử', 1, 1, 1, datetime.datetime(2024, 3, 1, 0, 0))]

In [45]:
%%sql
DELETE  
FROM    Question
WHERE   SUBSTRING_INDEX(`Content`, ' ', 2) = 'Câu hỏi';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [46]:
%%sql
SELECT *
FROM Question
WHERE SUBSTRING_INDEX(`Content`, ' ', 2) = 'Câu hỏi';

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

# Question 14. Update thông tin của Account có ID = 20 thành tên "Michael Fassbender" và email thành 'fassbender123@mmc.edu.vn'

In [49]:
%%sql
INSERT INTO `Account` (Email					    , Username		   , FullName		  , DepartmentID, PositionID, CreateDate    )
VALUES 				  ('michael_jackson@gmail,com'  , 'michael_jackson', 'Michael Jackson', 3           , 3         , '2024-05-14'  );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [51]:
%%sql
SELECT  *
FROM    Account
ORDER BY `AccountID` DESC
LIMIT 1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(20, 'michael_jackson@gmail,com', 'michael_jackson', 'Michael Jackson', 3, 3, datetime.datetime(2024, 5, 14, 0, 0))]

In [55]:
%%sql
UPDATE  Account
SET     `FullName` = 'Michael Fassbender', `Email` = 'fassbender123@mmc.edu.vn'
WHERE   `AccountID` = 20;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [56]:
%%sql
SELECT  *
FROM    Account
ORDER BY `AccountID` DESC
LIMIT 1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(20, 'fassbender123@mmc.edu.vn', 'michael_jackson', 'Michael Fassbender', 3, 3, datetime.datetime(2024, 5, 14, 0, 0))]

# Question 15. Cập nhật Account có ID = 20 sẽ thuộc group có ID = 2

In [57]:
%%sql
INSERT INTO `GroupAccount`  (GroupID    , AccountID	            , JoinDate	       )
VALUES 					    (6          , 20                    , '2024-05-14'     );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [60]:
%%sql
SELECT  *
FROM    GroupAccount
WHERE   AccountID = 20;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(6, 20, datetime.datetime(2024, 5, 14, 0, 0))]

In [61]:
%%sql
UPDATE		`GroupAccount`
SET			GroupId = 2 
WHERE		AccountId = 20;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [62]:
%%sql
SELECT  *
FROM    GroupAccount
WHERE   AccountID = 20;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(2, 20, datetime.datetime(2024, 5, 14, 0, 0))]